{
  "meta": {
    "x-lang": "en"
  },
  "basics": {
    "name": "Christophe Carreau-Lacasse",
    "label": "Senior Fullstack Developer",
    "email": "chris.carreau@hotmail.com",
    "phone": "+1 (438) 825-2012",
    "location": {
      "city": "Montréal",
      "countryCode": "CA",
      "region": "Québec"
    },
    "summary": "Senior fullstack developer passionate about web development and all things interactive, with solid experience in back-end and DevOps. Leveraging deep expertise in microservices, CI/CD pipelines, and cloud technologies (GCP, AWS), I have contributed to large-scale projects, particularly in the video game industry, including live-service games with millions of users. My journey has allowed me to design scalable systems, streamline deployment processes, and enhance system observability using tools like Prometheus and New Relic. I've also mentored developers to improve team productivity and foster growth, all while staying driven by new technical challenges and continuous learning",
    "profiles": [
      {
        "network": "Github",
        "username": "chriscarreau",
        "url": "https://github.com/chriscarreau"
      }
    ]
  },
  "work": [
    {
      "name": "Big Fish Games",
      "company": "Big Fish Games",
      "position": "Senior Fullstack Developer",
      "startDate": "2024-11-01",
      "highlights": [
        "Part of a small agile team responsible for creating a web publishing portal built with Angular",
        "Managed a CI/CD pipeline with Kubernetes deployments on GCP, with observability using Prometheus and New Relic, reducing deployment time to a few minutes and enabling instant rollback in case of issues",
        "Simplified and adapted a complex microservices architecture (C# and Java) by removing unnecessary features and adding those required for the publishing portal. This approach accelerated development while maintaining a high level of optimization and ensuring effective service scalability",
        "Mentored junior developers by enhancing their technical and professional skills, enabling them to become more autonomous",
        "Implemented an optimized Docker Compose setup, reducing development environment setup time from several hours to a few minutes, thereby improving the productivity of the entire team"
      ]
    },
    {
      "name": "Behaviour Interactive",
      "company": "Behaviour Interactive",
      "position": "Senior Back-end Developer",
      "startDate": "2023-01-01",
      "endDate": "2024-10-31",
      "highlights": [
        "Contributed to the development and maintenance of a Node.js backend in TypeScript for \"Dead by Daylight,\" a live-service game with millions of players, ensuring the stability and scalability of backend services",
        "Led a complete overhaul of the microtransactions service (handling thousands of transactions daily), reducing the gap of approximately 10% between internal analytics and actual revenue. This improvement strengthened transaction observability and enabled more precise monetization decisions",
        "Investigated and fixed numerous bugs reported by players, often related to edge cases and unexpected usage scenarios. These fixes improved the stability and user experience of the game in production"
      ]
    },
    {
      "name": "Square Enix Montréal/Studio Onoma",
      "company": "Square Enix Montréal/Studio Onoma",
      "position": "Tools Developer",
      "startDate": "2019-01-01",
      "endDate": "2022-11-01",
      "highlights": [
        "Developed an internal Angular portal used by three game teams, centralizing Live-Ops management. This solution prevented each team from recreating their own backend, allowing them to focus solely on game development",
        "Collaborated on server code organized in a microservices architecture using C# (.NET 6) and Java",
        "Participated in the development of a Unity SDK facilitating the integration of backend services into the studio's games, enabling game teams to quickly access Live-Ops features without additional client-side effort",
        "Founded a developer guild focused on knowledge sharing, adopting best practices, and solving concrete problems faced by technical teams, thereby improving collaboration and overall developer efficiency at the studio"
      ]
    }
  ],
  "education": [
    {
      "institution": "Polytechnique Montréal",
      "area": "Software Engineering",
      "studyType": "Bachelor",
      "startDate": "2015-09-01",
      "endDate": "2020-04-01"
    }
  ],
  "skills": [
    {
      "name": "Front-end",
      "level": "Master",
      "keywords": [
        "Javascript",
        "Typescript",
        "Angular",
        "React",
        "Vue.js",
        "CSS/SCSS",
        "Tailwind CSS"
      ]
    },
    {
      "name": "Back-end",
      "level": "Master",
      "keywords": [
        "Micro-services",
        "Multi-Region",
        "C#/.NET",
        "Java",
        "VertX",
        "Node.js",
        "Rust",
        "PostgreSQL",
        "MS-SQL",
        "MongoDB"
      ]
    },
    {
      "name": "DevOps",
      "level": "Advanced",
      "keywords": [
        "TeamCity",
        "Jenkins",
        "GitLab",
        "GitHub",
        "CI/CD",
        "GCP",
        "AWS",
        "Azure",
        "Docker",
        "Kubernetes",
        "Terraform"
      ]
    },
    {
      "name": "Tools",
      "level": "Advanced",
      "keywords": [
        "Cypress",
        "Playwright",
        "Figma",
        "Git",
        "Perforce"
      ]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Master"
    }
  ],
  "projects": [
    {
      "name": "Movie Rater",
      "description": "Ultimate movie rating platform, where you find out your favorite movie by matching movies you've seen against each other",
      "summary": "Ultimate movie rating platform, where you find out your favorite movie by matching movies you've seen against each other",
      "highlights": [
        "Independently designed and implemented a custom ELO-based rating system for pairwise movie comparisons, exploring algorithmic design and ranking methodologies as a personal challenge",
        "Integrated a third-party API to fetch comprehensive movie data, teaching myself how to work with external APIs and manage data synchronization",
        "Set up a Docker-based containerized environment from scratch to streamline development and deployment, deepening my understanding of containerization and DevOps practices",
        "Built a responsive and intuitive front-end using React, experimenting with modern UI/UX principles to create an engaging user experience"
      ],
      "keywords": [
        "React",
        "Rust",
        "PostgreSQL"
      ],
      "url": "https://gitlab.com/chriscarreau/movie-rater",
      "type": "application",
      "roles": []
    }
  ]
}