{
  "meta": {
    "x-lang": "fr"
  },
  "basics": {
    "name": "Christophe Carreau-Lacasse",
    "label": "Programmeur Fullstack Sénior",
    "email": "chris.carreau@hotmail.com",
    "phone": "+1 (438) 825-2012",
    "location": {
      "city": "Montréal",
      "countryCode": "CA",
      "region": "Québec"
    },
    "summary": "Développeur fullstack sénior passionné par le développement web et tout ce qui est interactif, avec une solide expérience en back-end et DevOps. Grâce à une expertise approfondie en microservices, pipelines CI/CD et technologies cloud (GCP, AWS), j'ai contribué à des projets d'envergure, notamment dans l'industrie du jeu vidéo, incluant des jeux live-service avec des millions d'utilisateurs. Mon parcours m'a permis de concevoir des systèmes évolutifs, d'optimiser des processus de déploiement et d'améliorer l'observabilité des systèmes grâce à des outils comme Prometheus et New Relic. J'ai également encadré des développeurs pour accroître la productivité de l'équipe et favoriser leur croissance, tout en restant motivé par de nouveaux défis techniques et des opportunités d'apprentissage continu",
    "profiles": [
      {
        "network": "Github",
        "username": "chriscarreau",
        "url": "https://github.com/chriscarreau"
      }
    ]
  },
  "work": [
    {
      "name": "Big Fish Games",
      "company": "Big Fish Games",
      "position": "Programmeur Fullstack Sénior",
      "startDate": "2024-11-01",
      "highlights": [
        "Fait partie d'une petite équipe agile en charge de la création d'un portail de publication de jeu fait avec Angular",
        "Gestion d'un pipeline CI/CD avec déploiements Kubernetes sur GCP, avec observabilité grâce à Prometheus et New Relic, réduisant le temps de déploiement à quelques minutes et permettant un rollback instantané en cas de problème",
        "Simplifié et adapté une architecture serveur complexe en microservices (C# et Java) en supprimant les fonctionnalités inutiles et en ajoutant celles nécessaires au portail de publication. Cette approche a accéléré le développement tout en maintenant un haut niveau d'optimisation et en assurant une scalabilité efficace du service",
        "Mentoré des programmeurs juniors en développant leurs compétences techniques et professionnelles, afin qu'ils deviennent plus autonomes",
        "Mis en place une configuration optimisée avec Docker Compose, réduisant le temps de setup des environnements de développement de plusieurs heures à quelques minutes, améliorant ainsi la productivité de toute l'équipe"
      ]
    },
    {
      "name": "Behaviour Interactive",
      "company": "Behaviour Interactive",
      "position": "Programmeur back-end sénior",
      "startDate": "2023-01-01",
      "endDate": "2024-10-31",
      "highlights": [
        "Contribué au développement et à la maintenance d'un backend Node.js en Typescript pour \"Dead by Daylight\" un jeu live-service avec des millions de joueurs, garantissant la stabilité et l'évolutivité des services backend",
        "Mené une refonte complète du service de microtransactions (traitant des milliers de transactions par jour), réduisant l'écart d'environ 10% entre les analytics internes et les revenus réels. Cette amélioration a renforcé l'observabilité des transactions et permis des décisions plus précises en matière de monétisation",
        "Investigué et corrigé de nombreux bogues signalés par les joueurs, souvent liés à des cas limites et des scénarios d'utilisation imprévus. Ces correctifs ont amélioré la stabilité et l'expérience utilisateur du jeu en production"
      ]
    },
    {
      "name": "Square Enix Montréal/Studio Onoma",
      "company": "Square Enix Montréal/Studio Onoma",
      "position": "Programmeur Outils",
      "startDate": "2019-01-01",
      "endDate": "2022-11-01",
      "highlights": [
        "Développé un portail interne en Angular utilisé par trois équipes de jeux, permettant de centraliser la gestion des Live-Ops. Cela a évité à chaque équipe de recréer son propre backend, leur permettant ainsi de se concentrer uniquement sur le développement du jeu",
        "Collaboré sur le code serveur organisé en architecture de microservices en C# (.NET 6) et Java",
        "Participé au développement d'un SDK Unity facilitant l'intégration des services backend dans les jeux du studio, permettant aux équipes de jeu d'accéder rapidement aux fonctionnalités Live-Ops sans effort supplémentaire côté client",
        "Fondé une guilde de développeurs axée sur le partage de connaissances, l'adoption de meilleures pratiques et la résolution de problèmes concrets rencontrés par les équipes techniques, améliorant ainsi la collaboration et l'efficacité globale des développeurs du studio"
      ]
    }
  ],
  "education": [
    {
      "institution": "Polytechnique Montréal",
      "area": "Ingénierie Logicielle",
      "studyType": "Baccalauréat",
      "startDate": "2015-09-01",
      "endDate": "2020-04-01"
    }
  ],
  "skills": [
    {
      "name": "Front-end",
      "level": "master",
      "keywords": [
        "Javascript",
        "Typescript",
        "Angular",
        "React",
        "Vue.js",
        "CSS/SCSS",
        "Tailwind CSS"
      ]
    },
    {
      "name": "Back-end",
      "level": "master",
      "keywords": [
        "Micro-services",
        "Multi-Region",
        "C#/.NET",
        "Java",
        "VertX",
        "Node.js",
        "Rust",
        "PostgreSQL",
        "MS-SQL",
        "MongoDB"
      ]
    },
    {
      "name": "DevOps",
      "level": "advanced",
      "keywords": [
        "TeamCity",
        "Jenkins",
        "GitLab",
        "GitHub",
        "CI/CD",
        "GCP",
        "AWS",
        "Azure",
        "Docker",
        "Kubernetes",
        "Terraform"
      ]
    },
    {
      "name": "Outils",
      "level": "advanced",
      "keywords": [
        "Cypress",
        "Playwright",
        "Figma",
        "Git",
        "Perforce"
      ]
    }
  ],
  "languages": [
    {
      "language": "Français",
      "fluency": "Langue maternelle"
    },
    {
      "language": "Anglais",
      "fluency": "Expert"
    }
  ],
  "projects": [
    {
      "name": "Movie Rater",
      "description": "La plateforme de classement de films ultime! Découvrez quel est votre film préféré à l'aide d'une série de comparaisons par paire des films que vous avez déjà visionnés",
      "summary": "La plateforme de classement de films ultime! Découvrez quel est votre film préféré à l'aide d'une série de comparaisons par paire des films que vous avez déjà visionnés",
      "highlights": [
        "Conçu et implémenté de manière indépendante un système de classement basé sur l'algorithme ELO pour des comparaisons par paires de films, explorant la conception algorithmique et les méthodologies de classement comme un défi personnel",
        "Intégré une API tierce pour récupérer des données complètes sur les films, m'initiant au travail avec des API externes et à la synchronisation des données",
        "Mis en place un environnement conteneurisé avec Docker à partir de zéro pour simplifier le développement et le déploiement, approfondissant ainsi ma compréhension de la conteneurisation et des pratiques DevOps",
        "Développé une interface front-end réactive et intuitive avec React, expérimentant avec les principes modernes d'UI/UX pour créer une expérience utilisateur engageante"
      ],
      "keywords": [
        "React",
        "Rust",
        "PostgreSQL"
      ],
      "url": "https://gitlab.com/chriscarreau/movie-rater",
      "type": "application",
      "roles": []
    }
  ]
}